export const validEmail =
  /^[a-zA-Z0-9.!#$%&'*+/=?^_`{|}~-]+@[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(?:\.[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/;

{
  /* /^
  [a-zA-Z0-9.!#$%&'*+/=?^_`{|}~-]+              # локальная часть
  @                                             # символ @
  [a-zA-Z0-9]                                   # первый символ домена (буква или цифра)
  (?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?           # остальная часть домена (0-61 символов)
  (?:\.[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*  # поддомены (если есть)
$/; */
}
